## **Tugas Besar 2 Pengenalan Komputasi**
### **Kelompok 6**
- Ester Tri Wahyuningsih (16022101)
- Rayyan Hannata Denan   (16022106)
- Valentinus Brian Johan (16022111)
- Brian Matthew          (16022116)

### Import modul-modul yang dibutuhkan dari library

In [102]:
import pandas as pd
from matplotlib import pyplot as plt

### File 'supermarket_sales - Sheet1.csv' dimasukkan ke variabel bernama df menggunakan library pandas

In [103]:
df = pd.read_csv('supermarket_sales - Sheet1.csv')

### Menampilkan dataframe

In [104]:
df

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,233-67-5758,C,Naypyitaw,Normal,Male,Health and beauty,40.35,1,2.0175,42.3675,1/29/2019,13:46,Ewallet,40.35,4.761905,2.0175,6.2
996,303-96-2227,B,Mandalay,Normal,Female,Home and lifestyle,97.38,10,48.6900,1022.4900,3/2/2019,17:16,Ewallet,973.80,4.761905,48.6900,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,1.5920,33.4320,2/9/2019,13:22,Cash,31.84,4.761905,1.5920,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home and lifestyle,65.82,1,3.2910,69.1110,2/22/2019,15:33,Cash,65.82,4.761905,3.2910,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion accessories,88.34,7,30.9190,649.2990,2/18/2019,13:28,Cash,618.38,4.761905,30.9190,6.6

## Kolom 1 **'Invoice ID'**
### Invoice ID merupakan *computer-generated number* yang digunakan untuk mengidentifikasi sebuah transaksi

### Khusus untuk data ini, invoice ID tidak memuat suatu pola tertentu (contoh: 3 angka pertama berisi kode cabang dan lokasi, 2 angka ditengah berisi kode barang yang dibeli)
### Berikut sampel data invoice ID dengan **3 angka pertama yang sama**

In [105]:
id = df['Invoice ID'].str.contains('101-', case=False, na = False )
df[id]
# Berikut data Invoice ID yang memuat nomor '803' sebagai 3 angka pertama

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
162,101-17-6199,A,Yangon,Normal,Male,Food and beverages,45.79,7,16.0265,336.5565,3/13/2019,19:44,Credit card,320.53,4.761905,16.0265,7.0
867,101-81-4070,C,Naypyitaw,Member,Female,Health and beauty,62.82,2,6.2820,131.9220,1/17/2019,12:36,Ewallet,125.64,4.761905,6.2820,4.9

### Berikut sampel data invoice ID dengan **2 angka tengah yang sama**

In [106]:
id2 = df['Invoice ID'].str.contains('-01-', case=False, na = False )
df[id2]
# Berikut data Invoice ID yang memuat nomor '803' sebagai 3 angka pertama

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
79,756-01-7507,C,Naypyitaw,Normal,Female,Health and beauty,20.38,5,5.0950,106.9950,1/22/2019,18:56,Cash,101.90,4.761905,5.0950,6.0
99,733-01-9107,B,Mandalay,Normal,Male,Home and lifestyle,82.70,6,24.8100,521.0100,3/5/2019,18:14,Cash,496.20,4.761905,24.8100,7.4
108,588-01-7461,C,Naypyitaw,Normal,Female,Food and beverages,33.98,9,15.2910,321.1110,3/24/2019,10:43,Cash,305.82,4.761905,15.2910,4.2
114,237-01-6122,C,Naypyitaw,Member,Female,Home and lifestyle,80.79,9,36.3555,763.4655,2/1/2019,20:31,Credit card,727.11,4.761905,36.3555,9.5
198,699-01-4164,C,Naypyitaw,Normal,Male,Health and beauty,41.50,4,8.3000,174.3000,3/12/2019,19:58,Credit card,166.00,4.761905,8.3000,8.2
221,468-01-2051,B,Mandalay,Normal,Male,Food and beverages,62.08,7,21.7280,456.2880,3/6/2019,13:46,Ewallet,434.56,4.761905,21.7280,5.4
306,286-01-5402,A,Yangon,Normal,Female,Sports and travel,40.23,7,14.0805,295.6905,3/30/2019,13:22,Cash,281.61,4.761905,14.0805,9.6
376,843-01-4703,B,Mandalay,Member,Female,Home and lifestyle,35.38,9,15.9210,334.3410,1/5/2019,19:50,Credit card,318.42,4.761905,15.9210,9.6
396,316-01-3952,A,Yangon,Normal,Female,Food and beverages,54.27,5,13.5675,284.9175,3/13/2019,14:16,Ewallet,271.35,4.761905,13.5675,4.6
450,891-01-7034,B,Mandalay,Normal,Female,Electronic accessories,74.71,6,22.4130,470.6730,1/1/2019,19:07,Cash,448.26,4.761905,22.4130,6.7
485,438-01-4015,B,Mandalay,Member,Female,Sports and travel,49.49,4,9.8980,207.8580,3/21/2019,15:25,Ewallet,197.96,4.761905,9.8980,6.6
524,534-01-4457,A,Yangon,Normal,Male,Food and beverages,81.71,6,24.5130,514.7730,1/27/2019,14:36,Credit card,490.26,4.761905,24.5130,8.0
693,196-01-2849,C,Naypyitaw,Member,Female,Fashion accessories,73.38,7,25.6830,539.3430,2/10/2019,13:56,Cash,513.66,4.761905,25.6830,9.5
909,624-01-8356,B,Mandalay,Normal,Female,Home and lifestyle,49.01,10,24.5050,514.6050,1/27/2019,10:44,Credit card,490.10,4.761905,24.5050,4.2
993,690-01-6631,B,Mandalay,Normal,Male,Fashion accessories,17.49,10,8.7450,183.6450,2/22/2019,18:35,Ewallet,174.90,4.761905,8.7450,6.6

## Kolom 2 **'Branch'**

### Kolom **'Branch'** berisi data mengenai kode kota tempat transaksi dilakukan

### Terdapat 3 kode kota yaitu **A**, **B**, dan **C** dengan jumlah transaksi di tiap-tiap branch :

In [107]:
pd.DataFrame(df['Branch'].value_counts())
# Jumlah data yang telah disortir berdasarkan 'Branch'

   Branch
A     340
B     332
C     328

## Kolom 3 **'City'**

### Kolom **'City'** berisi data mengenai kota tempat transaksi dilakukan

### Terdapat 3 kode kota yaitu **Yangon**, **Mandalay**, dan **Naypyitaw** dengan jumlah transaksi di tiap-tiap kota :

In [108]:
pd.DataFrame(df['City'].value_counts())
# Jumlah data yang telah disortir berdasarkan 'City'

           City
Yangon      340
Mandalay    332
Naypyitaw   328

## Kolom 4 **'Customer type'**

### Kolom **'Customer Type'** berisi data jenis membership pelanggan

### Terdapat 2 *customer type* yaitu *member* dan *normal* dengan jumlah masing-masing :

In [109]:
pd.DataFrame(df['Customer type'].value_counts())

        Customer type
Member            501
Normal            499

## Kolom 5 **'Gender'**

### Kolom **'Gender'** berisi data jenis kelamin pelanggan

### Terdapat 2 jenis kelamin yaitu *male* dan *female* dengan jumlah masing-masing :

In [110]:
pd.DataFrame(df['Gender'].value_counts())

        Gender
Female     501
Male       499

## Kolom 6 **'Product line'**

### Kolom **'Product line'** berisi data jenis barang yang dibeli pelanggan

### Terdapat 6 *product line* dengan jumlah masing-masing :

In [111]:
PL = pd.DataFrame(df['Product line'].value_counts())
PL

                        Product line
Fashion accessories              178
Food and beverages               174
Electronic accessories           170
Sports and travel                166
Home and lifestyle               160
Health and beauty                152

### Berikut *product line* yang paling banyak dibeli :

In [112]:
max_p = PL['Product line'].max()
PL.loc[PL['Product line'] == max_p]

                     Product line
Fashion accessories           178

### Berikut *product line* yang paling sedikit dibeli :

In [113]:
min_p = PL['Product line'].min()
PL.loc[PL['Product line'] == min_p]

                   Product line
Health and beauty           152

## Kolom 7 **'Unit price'**

### Kolom **'Unit price'** berisi data harga barang yang dibeli

### Berikut transaksi dengan *Unit price* tertinggi

In [114]:
max_U = df['Unit price'].max()
df.loc[df['Unit price'] == max_U]

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
122,219-22-9386,B,Mandalay,Member,Male,Sports and travel,99.96,9,44.982,944.622,3/9/2019,17:26,Credit card,899.64,4.761905,44.982,4.2
983,148-41-7930,C,Naypyitaw,Normal,Male,Health and beauty,99.96,7,34.986,734.706,1/23/2019,10:33,Cash,699.72,4.761905,34.986,6.1

### Berikut transaksi dengan *Unit price* terendah

In [115]:
min_U = df['Unit price'].min()
df.loc[df['Unit price'] == min_U]

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
944,333-23-2632,A,Yangon,Member,Male,Health and beauty,10.08,7,3.528,74.088,3/28/2019,20:14,Cash,70.56,4.761905,3.528,4.2

## Kolom 8 **'Quantity'**

### Kolom **'Quantity'** berisi data jumlah barang yang dibeli tiap transaksi

In [116]:
max_q = df['Quantity'].max()
print('Jumlah barang terbanyak yang pernah dibeli dalam satu transaksi adalah', max_q, 'barang')

Jumlah barang terbanyak yang pernah dibeli dalam satu transaksi adalah 10 barang

In [117]:
min_q = df['Quantity'].min()
print('Jumlah barang paling sedikit yang pernah dibeli dalam satu transaksi adalah', min_q, 'barang')

Jumlah barang paling sedikit yang pernah dibeli dalam satu transaksi adalah 1 barang

### Berikut jumlah transaksi dari tiap-tiap *Quantity* :

In [118]:
pd.DataFrame(df['Quantity'].value_counts())

    Quantity
10       119
1        112
4        109
7        102
5        102
6         98
9         92
2         91
3         90
8         85

## Kolom 9 **'Tax 5%'**

### Kolom **'Tax 5%'** berisi data jumlah pajak yang diberikan untuk suatu transaksi

### Berikut transaksi dengan jumlah pajak terbesar :

In [119]:
df.nlargest(1, columns='Tax 5%').loc[:,['Invoice ID', 'Unit price', 'Quantity', 'Tax 5%', 'Total']]

      Invoice ID  Unit price  Quantity  Tax 5%    Total
350  860-79-0874        99.3        10   49.65  1042.65

### Berikut transaksi dengan jumlah pajak paling sedikit :

In [120]:
df.nsmallest(1, columns='Tax 5%').loc[:,['Invoice ID', 'Unit price', 'Quantity', 'Tax 5%', 'Total']]

      Invoice ID  Unit price  Quantity  Tax 5%    Total
822  784-21-9238       10.17         1  0.5085  10.6785

## Kolom 10 **'Total'**

### Kolom 'Total' berisi data jumlah yang harus dibayarkan pada suatu transaksi

### nilai *Total* dapat dicari menggunakan rumus :
$
Total = [Quantity * Unit price] + \frac{5}{100} [Quantity * Unit price]
$

### Berikut transaksi dengan total pembayaran terbesar :

In [121]:
df.nlargest(1, columns='Total').loc[:,['Invoice ID', 'Unit price', 'Quantity', 'Tax 5%', 'Total']]

      Invoice ID  Unit price  Quantity  Tax 5%    Total
350  860-79-0874        99.3        10   49.65  1042.65

### Berikut transaksi dengan total pembayaran paling sedikit :

In [122]:
df.nsmallest(1, columns='Total').loc[:,['Invoice ID', 'Unit price', 'Quantity', 'Tax 5%', 'Total']]

      Invoice ID  Unit price  Quantity  Tax 5%    Total
822  784-21-9238       10.17         1  0.5085  10.6785

## Kolom 11 **'Date'**

### Kolom 'Date' berisi data tanggal terjadinya transaksi

### Berikut data jumlah transaksi tiap bulan dari Januari sampai maret

In [123]:
df['Date'] = pd.to_datetime(df['Date'])
Tot_Jan = len(df.loc[df['Date'] < '2/1/2019'])
Tot_Feb = len(df.loc[(df['Date'] > '1/31/2019') & (df['Date'] < '3/1/2019')])
Tot_Mar = len(df.loc[(df['Date'] > '2/28/2019') & (df['Date'] < '3/31/2019')])
T_perbulan = {}
T_perbulan['Month'] = ['January', 'February', 'March']
T_perbulan['Transactions'] = [Tot_Jan,Tot_Feb, Tot_Mar]
dfd = pd.DataFrame(data=T_perbulan)
dfd

      Month  Transactions
0   January           352
1  February           303
2     March           345

### Berikut bulan dengan transaksi terbanyak

In [124]:
dfd.nlargest(1, columns= 'Transactions')

     Month  Transactions
0  January           352

### Berikut bulan dengan transaksi paling sedikit

In [125]:
dfd.nsmallest(1, columns= 'Transactions')

      Month  Transactions
1  February           303

## Kolom 12 **'Time'**

In [126]:
df.sort_values(by='Time')

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
913,522-57-8364,A,Yangon,Member,Male,Fashion accessories,51.34,8,20.5360,431.2560,2019-01-31,10:00,Ewallet,410.72,4.761905,20.5360,7.6
180,130-98-8941,C,Naypyitaw,Normal,Male,Fashion accessories,64.26,7,22.4910,472.3110,2019-02-09,10:00,Cash,449.82,4.761905,22.4910,5.7
293,316-68-6352,A,Yangon,Member,Female,Food and beverages,36.36,2,3.6360,76.3560,2019-01-21,10:00,Cash,72.72,4.761905,3.6360,7.1
200,606-80-4905,C,Naypyitaw,Member,Female,Sports and travel,19.15,6,5.7450,120.6450,2019-01-29,10:01,Credit card,114.90,4.761905,5.7450,6.8
669,679-22-6530,B,Mandalay,Normal,Female,Sports and travel,40.62,2,4.0620,85.3020,2019-01-17,10:01,Credit card,81.24,4.761905,4.0620,4.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
106,628-34-3388,C,Naypyitaw,Normal,Male,Fashion accessories,27.38,6,8.2140,172.4940,2019-01-05,20:54,Credit card,164.28,4.761905,8.2140,7.9
267,571-94-0759,B,Mandalay,Member,Female,Food and beverages,74.60,10,37.3000,783.3000,2019-01-08,20:55,Cash,746.00,4.761905,37.3000,9.5
893,715-20-1673,B,Mandalay,Normal,Male,Electronic accessories,28.38,5,7.0950,148.9950,2019-03-06,20:57,Cash,141.90,4.761905,7.0950,9.4
136,700-81-1757,A,Yangon,Normal,Female,Electronic accessories,26.31,5,6.5775,138.1275,2019-01-18,20:59,Credit card,131.55,4.761905,6.5775,8.8
935,235-06-8510,C,Naypyitaw,Member,Male,Home and lifestyle,85.72,3,12.8580,270.0180,2019-01-24,20:59,Ewallet,257.16,4.761905,12.8580,5.1

In [132]:
df.loc[(df['Time'] >= '10') & (df['Time'] < '12' )]

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,10:29,Cash,76.40,4.761905,3.8200,9.6
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37,Ewallet,604.17,4.761905,30.2085,5.3
7,315-22-5665,C,Naypyitaw,Normal,Female,Home and lifestyle,73.56,10,36.7800,772.3800,2019-02-24,11:38,Ewallet,735.60,4.761905,36.7800,8.0
12,365-64-0515,A,Yangon,Normal,Female,Electronic accessories,46.95,5,11.7375,246.4875,2019-02-12,10:25,Ewallet,234.75,4.761905,11.7375,7.1
16,656-95-9349,A,Yangon,Member,Female,Health and beauty,68.93,7,24.1255,506.6355,2019-03-11,11:03,Credit card,482.51,4.761905,24.1255,4.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
975,883-69-1285,B,Mandalay,Member,Male,Fashion accessories,49.92,2,4.9920,104.8320,2019-03-06,11:55,Credit card,99.84,4.761905,4.9920,7.0
976,221-25-5073,A,Yangon,Normal,Female,Food and beverages,74.66,4,14.9320,313.5720,2019-03-04,10:39,Cash,298.64,4.761905,14.9320,8.5
983,148-41-7930,C,Naypyitaw,Normal,Male,Health and beauty,99.96,7,34.9860,734.7060,2019-01-23,10:33,Cash,699.72,4.761905,34.9860,6.1
984,189-40-5216,C,Naypyitaw,Normal,Male,Electronic accessories,96.37,7,33.7295,708.3195,2019-01-09,11:40,Cash,674.59,4.761905,33.7295,6.0
994,652-49-6720,C,Naypyitaw,Member,Female,Electronic accessories,60.95,1,3.0475,63.9975,2019-02-18,11:40,Ewallet,60.95,4.761905,3.0475,5.9